ЧартерEDT.Расширение1/src/Reports/СправкаБКАЭ_ПоПодрядчику/СправкаБКАЭ_ПоПодрядчику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СправкаБКАЭ_ПоПодрядчику</name>
</mdclass:Report>

ЧартерEDT.Расширение1/src/AccumulationRegisters/RoomInventory/RoomInventory.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="aeb81e75-04ad-4f43-868f-b8ea2669c5d7">
  <name>RoomInventory</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="7187f02a-e01a-4fa4-a90d-ed9ace802a97">
    <name>Counter</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c26c8823-5255-4588-91ab-3f27f6c31ff5">
    <name>TotalRooms</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="78098442-cc9e-4761-848d-af64c2f5109f">
    <name>TotalBeds</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="357a8f84-1ec8-4df6-9544-5f74d86b72dc">
    <name>RoomsBlocked</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="22789c75-f8a9-477f-9281-68c367895c20">
    <name>BedsBlocked</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bd1ad0c3-3520-47a2-bdf8-f2fef29a4b16">
    <name>ExpectedRoomsCheckedOut</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="62777090-ae79-44c3-adca-787e958cc1e8">
    <name>ExpectedBedsCheckedOut</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="971c16cd-9b59-45e8-819e-a9a3c7e36f30">
    <name>ExpectedGuestsCheckedOut</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c1a65555-7280-42d8-953d-4784a4163e9f">
    <name>GuestsReserved</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="0f95b9b2-b56a-4639-a4f1-fca810dc2b4c">
    <name>RoomsReserved</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="5d6674d8-44b4-44fb-b651-3f701f20e111">
    <name>RoomsVacant</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c4b4557e-9287-41d4-8e59-2df23edb9117">
    <name>BedsVacant</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="ecdde1f9-5cf0-450e-9c85-240a41e21dc3">
    <name>IsInHouse</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e2dd1591-19cc-42df-853b-928c89fabd9b">
    <name>IsAccommodation</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0bee4da2-3939-441c-b5f7-b1232729f041">
    <name>PeriodFrom</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8b252a75-9287-4325-a6cb-0a88bdce9ca2">
    <name>PeriodTo</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="46d7e314-d052-46d5-8347-a165acef5625">
    <name>Customer</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95181482-afb2-4654-9864-0ec98c2b823d">
    <name>GuestGroup</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="31da10c9-481a-48a5-ac2c-46a0315d7a6f">
    <name>Guest</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e9ecc1c4-80e9-4cf0-8d39-e9e904be978a">
    <name>CheckOutDate</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dda37713-d4e8-4591-886d-de3bfbcc0dad">
    <name>NumberOfPersons</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b999d1f7-084e-4966-935f-e9425a773bad">
    <name>IsCheckOut</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad21bcb0-f275-4cd5-aaa9-b4f0ac09f5e1">
    <name>IsReservation</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="daff9aed-b7c8-4664-8fc9-8434ccd4dcad">
    <name>CheckInDate</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="efee26ee-0b75-4a40-80b3-1cef1c5a4ba0">
    <name>RoomQuota</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="860bbeda-97f5-4e71-9843-8c52beecca35">
    <name>Room</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0f7bef0b-3f02-45bd-bf04-1f07ad0da4e1">
    <name>Hotel</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="187fbf66-3954-47d0-8c0f-925b11f74ee2">
    <name>RoomType</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ЧартерEDT.Расширение1/src/InformationRegisters/Расш1_СоставНомерногоФонда/Расш1_СоставНомерногоФонда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Расш1_СоставНомерногоФонда</name>
  <resources>
    <name>НомернойФонд</name>
    <type>
      <types>CatalogRef.Расш1_НомерныеФонды</types>
    </type>
  </resources>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>CatalogRef.Rooms</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЧартерEDT.Расширение1/src/Reports/СправкаБКАЭ_ПоПодрядчику/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Подрядчик) Тогда 
		Сообщить("Для корректного формирования отчета нужно выбрать Подрядчика!");
		Возврат;
	КонецЕсли;	
	
	ТабДокДляПечати = Неопределено;
	
	СоответвиеТабДок = Новый Соответствие; 
	
	ТЗ_Итоговая = Новый ТаблицаЗначений;
	
	ТЗ_Итоговая.Колонки.Добавить("Организация");
	ТЗ_Итоговая.Колонки.Добавить("Дом");
	ТЗ_Итоговая.Колонки.Добавить("Всего");
	ТЗ_Итоговая.Колонки.Добавить("Занято");
	ТЗ_Итоговая.Колонки.Добавить("Номер");
	
	ТабДок.Очистить();
	
	Макет = Отчеты.СправкаБКАЭ.ПолучитьМакет("Макет");
		
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.ДатаОтчета = Формат(ДатаОтчета, "ДФ='dd.MM.yyyy ""г.""'");
	ТабДок.Вывести(Область);
	
	Hotel = SessionParameters.CurrentHotel;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Расш1_НомерныеФонды.Ссылка КАК НомернойФонд
	|ПОМЕСТИТЬ ВТ_НомерныеФонды
	|ИЗ
	|	Справочник.Расш1_НомерныеФонды КАК Расш1_НомерныеФонды
	|ГДЕ
	|	НЕ Расш1_НомерныеФонды.ПометкаУдаления
	|	И Расш1_НомерныеФонды.ПоказыватьВСпрвкеБКАЭ
	|	И Расш1_НомерныеФонды.Ref = &qПодрядчик
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;	
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT ALLOWED
	|RoomInventoryBalance.Hotel AS Hotel,
	|RoomInventoryBalance.Room AS Room,
	|1 как Всего
	|INTO RoomInventoryBalance
	|FROM
	|	AccumulationRegister.RoomInventory.Balance(
	|			&qDate,
	|			TRUE
	|				AND Hotel = &qHotel) AS RoomInventoryBalance
	|WHERE
	|	ISNULL(RoomInventoryBalance.TotalRoomsBalance, 0) > 0
	|;	
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT ALLOWED
	|	ResDocuments.Recorder AS Accommodation,
	|	ResDocuments.Room AS Room,
	|	1 как Занят
	|INTO ResDocuments
	|FROM
	|	AccumulationRegister.RoomInventory AS ResDocuments
	|WHERE
	|	ResDocuments.PeriodFrom < &qPeriodTo
	|	AND ResDocuments.PeriodTo > &qPeriodFrom
	|	AND ResDocuments.Hotel = &qHotel
	|	AND ResDocuments.RecordType = &qExpense
	|	AND (ResDocuments.IsAccommodation
	|			OR ResDocuments.IsReservation)
	|
	|GROUP BY
	|	ResDocuments.Recorder,
	|	ResDocuments.Room
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT ALLOWED
	|	RoomInventoryBalance.Hotel AS Hotel,
	|	RoomInventoryBalance.Room AS Room,
	|	Documents.Accommodation AS Accommodation,
	|	Documents.Accommodation.Guest AS Guest,
	|	Выбор когда RoomInventoryBalance.Room.НеУчитыватьВСправке тогда 0 иначе  RoomInventoryBalance.всего конец как Всего,
	|	Documents.Занят как Занят
	|INTO Accommodations
	|FROM
	|	RoomInventoryBalance AS RoomInventoryBalance
	|		LEFT JOIN ResDocuments AS Documents
	|		ON RoomInventoryBalance.Room = Documents.Room
	|		внутреннее соединение InformationRegister.Расш1_СоставНомерногоФонда AS Расш1_СоставНомерногоФонда
	|		ON RoomInventoryBalance.Room = Расш1_СоставНомерногоФонда.Номер
	|       и (Расш1_СоставНомерногоФонда.НомернойФонд в (Выбрать ВТ_НомерныеФонды.НомернойФонд из ВТ_НомерныеФонды как ВТ_НомерныеФонды)
	|			или Расш1_СоставНомерногоФонда.НомернойФонд = Значение(Справочник.Расш1_НомерныеФонды.ПустаяСсылка))
	|WHERE
	|	НЕ RoomInventoryBalance.Room.IsVirtual
	|
	|GROUP BY
	|	RoomInventoryBalance.Hotel,
	|	RoomInventoryBalance.Room,
	|	Documents.Accommodation,
	|	Documents.Accommodation.Guest,
	|	RoomInventoryBalance.Всего,
	|	Documents.Занят
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Accommodations.Room AS Room,
	|	ISNULL(Accommodations.Room.Description, """") AS RoomDescription,
	|	Accommodations.Room.ЭтажностьДома AS ЭтажностьДома,
	|	Accommodations.Room.КоличествоКвартир AS КоличествоКвартир,
	|	Расш1_СоставНомерногоФонда.НомернойФонд.Ref AS Организация,
	|	Accommodations.Room.НомерКвартиры AS Квартира,
	|	Accommodations.Room.SortCode AS RoomSortCode,
	|	Accommodations.Guest.FullName AS СотрудникПолноеИмя,
	|	Accommodations.Guest.Position AS Должность,
	|	Accommodations.Guest.ПолноеИмяEng AS СотрудникПолноеИмяEng,
	|	Accommodations.Guest.Sex AS Пол,
	|	Isnull(Accommodations.Занят, 0) AS Занят,
	|	isnull(Accommodations.всего, 0) AS Всего
	|FROM
	|	Accommodations AS Accommodations
	|		LEFT JOIN InformationRegister.Расш1_СоставНомерногоФонда AS Расш1_СоставНомерногоФонда
	|		ON Accommodations.Room = Расш1_СоставНомерногоФонда.Номер
	|WHERE
	|	Расш1_СоставНомерногоФонда.НомернойФонд = &qПодрядчик
	|ORDER BY
	|	RoomSortCode
	|TOTALS 
	|SUM(Занят),
	|SUM(всего)
	|BY
	|	Room ONLY HIERARCHY";
	
	Запрос.УстановитьПараметр("qHotel", Hotel);
	Запрос.УстановитьПараметр("qDate", КонецДня(ДатаОтчета));
	Запрос.УстановитьПараметр("qPeriodTo", КонецДня(ДатаОтчета));
	Запрос.УстановитьПараметр("qPeriodFrom", КонецДня(ДатаОтчета));
	Запрос.УстановитьПараметр("qExpense", AccumulationRecordType.Expense);
	Запрос.УстановитьПараметр("qПодрядчик", Подрядчик);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаГруппировка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	Пока ВыборкаГруппировка.Следующий() Цикл
		
		ТД = Новый ТабличныйДокумент;
		Область = Макет.ПолучитьОбласть("Заголовок");
		Область.Параметры.ДатаОтчета = Формат(ДатаОтчета, "ДФ='dd.MM.yyyy ""г.""'");
		ТД.Вывести(Область);

		НомерПоПорядку = 1;
		
		Область = Макет.ПолучитьОбласть("Дом");
		Область.Параметры.НомерДома = ВыборкаГруппировка.Room;
		
		ТабДок.Вывести(Область, 1);
		ТД.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("ЗаголовокДом");
		ТабДок.Вывести(Область, 2);
		ТД.Вывести(Область);
		
		Выборка = ВыборкаГруппировка.Выбрать();
		
		НомерКвартиры = "";
		
		НачальнаяСтрока = ТабДок.ВысотаТаблицы + 1;
		НачальнаяСтрокаТД = ТД.ВысотаТаблицы + 1;
		
		Пока Выборка.Следующий() Цикл
			
			Если НомерКвартиры <> "" Тогда
				
				Если НомерКвартиры <> Выборка.Квартира Тогда
					
					КонечнаяСтрока = ТабДок.ВысотаТаблицы;
					КонечнаяСтрокаТД = ТД.ВысотаТаблицы;
					
					ТабДок.Область("R"+Формат(НачальнаяСтрока,"NG=")+"C2:R"+Формат(КонечнаяСтрока,"NG=") +"C2").Объединить();
					ТабДок.Область("R"+Формат(НачальнаяСтрока,"NG=")+"C3:R"+Формат(КонечнаяСтрока,"NG=")+"C3").Объединить();
					
					ТД.Область("R"+Формат(НачальнаяСтрокаТД,"NG=")+"C2:R"+Формат(КонечнаяСтрокаТД,"NG=")+"C2").Объединить();
					ТД.Область("R"+Формат(НачальнаяСтрокаТД,"NG=")+"C3:R"+Формат(КонечнаяСтрокаТД,"NG=")+"C3").Объединить();
					
					НачальнаяСтрока = ТабДок.ВысотаТаблицы + 1;
					НачальнаяСтрокаТД = ТД.ВысотаТаблицы + 1;
					
					НомерКвартиры = Выборка.Квартира;
					
				КонецЕсли;
			Иначе
				НомерКвартиры = Выборка.Квартира;
			КонецЕсли;
			
			НаименованиеКомнаты = Выборка.RoomDescription;
			Индекс = СтрНайти(НаименованиеКомнаты, "комн.");
			
			Если Индекс = 0 Тогда
				Индекс = СтрНайти(НаименованиеКомнаты, "Комн.");
			КонецЕсли;
			
			Если Индекс > 0 Тогда
				Комната = Прав(НаименованиеКомнаты, СтрДлина(НаименованиеКомнаты) - Индекс + 1);
			Иначе
				Комната = НаименованиеКомнаты;
			КонецЕсли;
			
			Область = Макет.ПолучитьОбласть("Строка");
			Область.Параметры.Номер = НомерПоПорядку;
			Область.Параметры.Организация = Выборка.Организация;
			Область.Параметры.Квартира = Выборка.Квартира;
			Область.Параметры.Комната = Комната;
			//Область.Параметры.Комната = Выборка.Room;
			Область.Параметры.Сотрудник = Выборка.СотрудникПолноеИмя;
			Область.Параметры.СотрудникАнгл = Выборка.СотрудникПолноеИмяEng;
			Область.Параметры.Должность = Выборка.Должность;
			Область.Параметры.Пол = Выборка.Пол;
			
			НомерПоПорядку = НомерПоПорядку + 1;
			
			ТабДок.Вывести(Область, 2);
			ТД.Вывести(Область);
			
			НоваяСтрока = ТЗ_Итоговая.Добавить();
			НоваяСтрока.Организация = Выборка.Организация;
			НоваяСтрока.Дом = ВыборкаГруппировка.Room;
			НоваяСтрока.Всего = Выборка.Всего;
			НоваяСтрока.Занято = Выборка.Занят;
			НоваяСтрока.Номер = Выборка.Room;
			
		КонецЦикла;
		
		ТабДок.Область("R"+Формат(НачальнаяСтрока,"NG=")+"C2:R"+Формат(ТабДок.ВысотаТаблицы,"NG=")+"C2").Объединить();
		ТабДок.Область("R"+Формат(НачальнаяСтрока,"NG=")+"C3:R"+Формат(ТабДок.ВысотаТаблицы,"NG=")+"C3").Объединить();
		
		ТД.Область("R"+Формат(НачальнаяСтрокаТД,"NG=")+"C2:R"+Формат(ТД.ВысотаТаблицы,"NG=")+"C2").Объединить();
		ТД.Область("R"+Формат(НачальнаяСтрокаТД,"NG=")+"C3:R"+Формат(ТД.ВысотаТаблицы,"NG=")+"C3").Объединить();
		
		СоответвиеТабДок.Вставить(ВыборкаГруппировка.Room.Description, ТД);
		
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьГруппировки = Истина;
	ТабДок.ПоказатьУровеньГруппировокСтрок(0);
	
	///////////////////////// Итог
	
	ТЗ_Итоговая.Свернуть("Организация, Дом,  Номер", "Всего, Занято");
	
	Для Каждого Строка Из ТЗ_Итоговая Цикл
		
		Если Строка.Всего > 1 Тогда
			Строка.Всего  = 1;	
		КонецЕсли;
		
	КонецЦикла;
	
	ТЗ_Итоговая.Свернуть("Организация, Дом", "Всего, Занято");
	
	ТабДокНовый = Новый ТабличныйДокумент;
	
	Макет = Отчеты.СправкаБКАЭ.ПолучитьМакет("МакетИтого1");

	Область = Макет.ПолучитьОбласть("ЗаголовокИтого");
	Область.Параметры.ДатаОтчета = Формат(ДатаОтчета, "ДФ='dd.MM.yyyy ""г.""'");
	ТабДокНовый.Вывести(Область);
	
	ВыборкаГруппировка.Сбросить();
	ВыборкаГруппировка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НачальнаяСтрока = ТабДокНовый.ВысотаТаблицы + 1;
	
	Область = Макет.ПолучитьОбласть("Шапка|Общая");
	ТабДокНовый.Вывести(Область);
	
	НомерКолонкиНачало = ТабДокНовый.ШиринаТаблицы + 1;
	
	Пока ВыборкаГруппировка.Следующий() Цикл
		
		ОбластьШапкаКолонки = Макет.ПолучитьОбласть("Шапка|Дом");
		ОбластьШапкаКолонки.Параметры.Дом = ВыборкаГруппировка.Room;
	
		ТабДокНовый.Присоединить(ОбластьШапкаКолонки);
		
	КонецЦикла;
	
	НомерКолонкиКонец = ТабДокНовый.ШиринаТаблицы;
	ТабДокНовый.Область("R"+Формат(НачальнаяСтрока,"NG=")+"C" + НомерКолонкиНачало + ":R"+Формат(НачальнаяСтрока,"NG=")+"C" + НомерКолонкиКонец).Объединить();
	
	ОбластьШапкаКолонки = Макет.ПолучитьОбласть("Шапка|Всего");
	ТабДокНовый.Присоединить(ОбластьШапкаКолонки);
	
	ТЗ_Организации = ТЗ_Итоговая.Скопировать();
	ТЗ_Организации.Свернуть("Организация", "Всего, Занято");
	
	Номер = 1;
	
	Для Каждого Организация Из ТЗ_Организации Цикл
		
		Область = Макет.ПолучитьОбласть("Строка|Общая");
		Область.Параметры.Субподрядчик = Организация.Организация;
		Область.Параметры.Номер = Номер;
		ТабДокНовый.Вывести(Область);
		
		ВыборкаГруппировка.Сбросить();
		ВыборкаГруппировка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаГруппировка.Следующий() Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("Организация", Организация.Организация);
			Отбор.Вставить("Дом", ВыборкаГруппировка.Room);
			
			Строки = ТЗ_Итоговая.НайтиСтроки(Отбор);
			
			Всего = 0;
			Занято = 0;
			
			Для каждого НайденнаяСтрока Из  Строки Цикл
				 Всего = Всего + НайденнаяСтрока.Всего;
				 Занято = Занято + НайденнаяСтрока.Занято;
			КонецЦикла;
		
			ОбластьСтрокаКолонки = Макет.ПолучитьОбласть("Строка|Дом");
			
			Если Строки.Количество() > 0 Тогда
				ОбластьСтрокаКолонки.Параметры.Всего = Всего;
				ОбластьСтрокаКолонки.Параметры.Занято = ?(Занято > 0, Занято, ?(Всего > 0, "0", Занято));
				ОбластьСтрокаКолонки.Параметры.Процент = ?(Всего = 0, 0, (Занято / Всего) * 100);
			КонецЕсли;
				
			ТабДокНовый.Присоединить(ОбластьСтрокаКолонки);
			
		КонецЦикла;
		
		ОбластьСтрокаКолонки = Макет.ПолучитьОбласть("Строка|Всего");
		ОбластьСтрокаКолонки.Параметры.Всего = Организация.Всего;
		ОбластьСтрокаКолонки.Параметры.Занято = ?(Организация.Занято > 0, Организация.Занято, ?(Организация.Всего > 0, "0", Организация.Занято));
		ОбластьСтрокаКолонки.Параметры.Процент = ?(Организация.Всего = 0, 0, (Организация.Занято / Организация.Всего) * 100);
		ТабДокНовый.Присоединить(ОбластьСтрокаКолонки);
		
		Номер = Номер + 1;
		
	КонецЦикла;
	
	ОбластьСтрокаКолонки = Макет.ПолучитьОбласть("Итого|Общая");
	ТабДокНовый.Вывести(ОбластьСтрокаКолонки);
	
	ВыборкаГруппировка.Сбросить();
	ВыборкаГруппировка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Всего = 0;
	Занято = 0;
	
	ТЗ_Дома = ТЗ_Итоговая.Скопировать();//
	ТЗ_Дома.Свернуть("Дом", "Всего, Занято");//
	
	Пока ВыборкаГруппировка.Следующий() Цикл
		
		Отбор = Новый Структура;//
		Отбор.Вставить("Дом", ВыборкаГруппировка.Room);//	
		Строки = ТЗ_Дома.НайтиСтроки(Отбор);
		
		Область = Макет.ПолучитьОбласть("Итого|Дом");
		
		Если Строки.Количество() > 0 Тогда
			Область.Параметры.Всего = Строки[0].Всего;
			Область.Параметры.Занято = Строки[0].Занято;
			Область.Параметры.Процент = ?(Строки[0].Всего=0, 0, Строки[0].Занято/Строки[0].Всего * 100);
			
			Всего = Всего + Строки[0].Всего;
			Занято = Занято +  Строки[0].Занято;
		КонецЕсли;	
		
		//Область.Параметры.Всего = ВыборкаГруппировка.Всего;
		//Область.Параметры.Занято = ВыборкаГруппировка.Занят;
		//Область.Параметры.Процент = ?(ВыборкаГруппировка.Всего=0, 0, ВыборкаГруппировка.Занят/ВыборкаГруппировка.Всего * 100);
		ТабДокНовый.Присоединить(Область);
		
		//Всего = Всего + ВыборкаГруппировка.Всего;
		//Занято = Занято +  ВыборкаГруппировка.Занят;

	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("Итого|Всего");
	Область.Параметры.Всего = Всего;
	Область.Параметры.Занято = ?(Занято > 0, Занято, ?(Всего > 0, "0", Занято));
	Область.Параметры.Процент = ?(Всего = 0, 0, (Занято / Всего) * 100);
	ТабДокНовый.Присоединить(Область);
	
	Область = Макет.ПолучитьОбласть("Подвал|Общая");
	ТабДокНовый.Вывести(Область);
	
	
	ВыборкаГруппировка.Сбросить();
	ВыборкаГруппировка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВсегоКомнат = 0;
	ВсегоКвартир = 0;
	
	Пока ВыборкаГруппировка.Следующий() Цикл
		
		Область = Макет.ПолучитьОбласть("Подвал|Дом");
		
		Отбор = Новый Структура;//
		Отбор.Вставить("Дом", ВыборкаГруппировка.Room);//	
		Строки = ТЗ_Дома.НайтиСтроки(Отбор);
			
		Если Строки.Количество() > 0 Тогда
			Область.Параметры.ВсегоКомнат = Строки[0].Всего;	
			ВсегоКомнат = ВсегоКомнат + Строки[0].Всего;
		КонецЕсли;
		
		Область.Параметры.ВсегоКвартир = ВыборкаГруппировка.КоличествоКвартир;
		Область.Параметры.ВсегоЭтажей = ВыборкаГруппировка.ЭтажностьДома;
		//Область.Параметры.ВсегоКомнат = ВыборкаГруппировка.Всего;
				
		ТабДокНовый.Присоединить(Область);
		
		//ВсегоКомнат = ВсегоКомнат + ВыборкаГруппировка.Всего;
		ВсегоКвартир = ВсегоКвартир + ВыборкаГруппировка.КоличествоКвартир;
		
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("Подвал|Всего");
	Область.Параметры.ВсегоКвартир = ВсегоКвартир;
	Область.Параметры.ВсегоКомнат = ВсегоКомнат;
	
	ТабДокНовый.Присоединить(Область);
	
	СоответвиеТабДок.Вставить("Свод", ТабДокНовый);
	
	ТабДокДляПечати = Новый ФиксированноеСоответствие(СоответвиеТабДок);

	ДобавитьТабдок(ТабДок, ТабДокНовый);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаОтчета = КонецДня(ТекущаяДата());
КонецПроцедуры

&НаСервере
Процедура ДобавитьТабдок(ТДПриемник, ТДИсточник)
	
	ТДИсточник.Область(1,1,ТДИсточник.ВысотаТаблицы,
	ТДИсточник.ШиринаТаблицы).СоздатьФорматСтрок();
	ТДПриемник.Вывести(ТДИсточник);
		
КонецПроцедуры


&НаКлиенте
Процедура SaveAsXLSX(Команда)
	
	Если ТабДокДляПечати = Неопределено Тогда
		ПоказатьПредупреждение(, "Необходимо сформировать отчет");
		Возврат;
	КонецЕсли;
	
	vFilePath = GetFileName();
	vFileType = SpreadsheetDocumentFileType.XLSX;
	SaveSpreadsheetToFile(vFileType, vFilePath);

КонецПроцедуры

&AtServer 
Function GetFileName()
	vFilePath = StrReplace(cmGetValidFileName(cmNStr(TrimAll("Заполненность номеров"))), " ", "_") + "_" + Format(CurrentDate(),"ДФ=dd.MM.yyyy");
	Return vFilePath;
EndFunction //GetFileName

&НаКлиенте
Function SaveSpreadsheetToFile(pFileType, pFilePath) Export
	vFileDlg = New FileDialog(FileDialogMode.Save);
	vFileDlg.FullFileName = pFilePath;
	vFileDlg.Multiselect = False;
	vFileDlg.Preview = False;
	vFileDlg.Title = NStr("en='Save to file';ru='Сохранить в файл';de='in Datei speichern'");
	If pFileType = SpreadsheetDocumentFileType.MXL Then
		vFileDlg.DefaultExt = "mxl";
		vFileDlg.Filter = NStr("en='1C spreadsheet format (*.mxl)|*.mxl';ru='Формат таблицы 1C (*.mxl)|*.mxl';de='Format der Tabelle 1C (*.mxl)|*.mxl'");
	ElsIf pFileType = SpreadsheetDocumentFileType.XLSX Then
		vFileDlg.DefaultExt = "xlsx";
		vFileDlg.Filter = NStr("en='Microsoft Excel format (*.xlsx)|*.xlsx';ru='Формат Microsoft Excel (*.xlsx)|*.xlsx';de='Format Microsoft Excel (*.xlsx)|*.xlsx'");
	ElsIf pFileType = SpreadsheetDocumentFileType.HTML Then
		vFileDlg.DefaultExt = "html";
		vFileDlg.Filter = NStr("en='HTML format (*.html)|*.html';ru='Формат HTML (*.html)|*.html';de='Format HTML (*.html)|*.html'");
	ElsIf pFileType = SpreadsheetDocumentFileType.PDF Then
		vFileDlg.DefaultExt = "pdf";
		vFileDlg.Filter = NStr("en='Adobe Reader PDF format (*.pdf)|*.pdf';ru='Формат Adobe Reader PDF (*.pdf)|*.pdf';de='Format Adobe Reader PDF (*.pdf)|*.pdf'");
	Else
		Return False;
	EndIf;
	vNotifity = new NotifyDescription("SelectFileEnd", ЭтотОбъект);
	vFileDlg.Show(vNotifity);
EndFunction //SaveSpreadsheetToFile

//-----------------------------------------------------------------------------
&НаКлиенте
Procedure SelectFileEnd(pSelectedItem, pAdditionalParameters) Export
	
	If pSelectedItem = Undefined Then
		Возврат;	
	EndIf;
	
	СписокОбластей = Новый СписокЗначений;
	
	Для каждого КлючЗначение Из ТабДокДляПечати Цикл
		
		ПредставлениеОбласти = КлючЗначение.Ключ;
		
		ВхождениеПервойСкобки = СтрНайти(ПредставлениеОбласти,"(");

		Если ВхождениеПервойСкобки > 0 Тогда
			ПредставлениеОбласти = Лев(ПредставлениеОбласти, ВхождениеПервойСкобки -1);
		КонецЕсли;
		
		Попытка 
			ПредставлениеОбласти = Число(ПредставлениеОбласти);
		Исключение
			
		КонецПопытки;

		СписокОбластей.Добавить(ПредставлениеОбласти, КлючЗначение.Ключ);
		
	КонецЦикла;	
	
	СписокОбластей.СортироватьПоЗначению();
	
	Пакет = Новый ПакетОтображаемыхДокументов;
	
	Для Каждого Область Из СписокОбластей Цикл
		
		ЭлементПакета = Пакет.Состав.Добавить();
		ЭлементПакета.Наименование = Область.Представление;
		ЭлементПакета.Данные = ПоместитьВоВременноеХранилище(ТабДокДляПечати.Получить(Область.Представление));
		
	КонецЦикла;	
		
	Попытка
		
		Пакет.Записать(pSelectedItem[0], ТипФайлаПакетаОтображаемыхДокументов.XLSX);
		ПоказатьПредупреждение(, "Файл выгружен в " + pSelectedItem[0]);
		ЗапуститьПриложение(pSelectedItem[0]);
		
	Исключение
		
		ПоказатьПредупреждение(,"Ошибка выгрузки в " + pSelectedItem[0]);
		Сообщить(ОписаниеОшибки());
		
	КонецПопытки;
	
EndProcedure //SelectFileEnd

&AtClient
Procedure SendByEMail(pCommand)
	
	Если ТабДокДляПечати = Неопределено Тогда
		ПоказатьПредупреждение(, "Необходимо сформировать отчет");
		Возврат;
	КонецЕсли;
	
	vParams = GenerateParametersByEMail();
	
	Если vParams.Свойство("Ошибка") Тогда
		ПоказатьПредупреждение(, vParams.Ошибка);
		Возврат;
	КонецЕсли;
	
	OpenForm("CommonForm.tcSendMail", vParams, ThisForm, ThisForm.UUID);
	
EndProcedure //SendByEMail

&AtServer
Function GenerateParametersByEMail()
	
	vFileName = GetFileName();
	vFilePath = cmGetFullFileName(vFileName, TempFilesDir()) + ".XLSX";
	vFileType = SpreadsheetDocumentFileType.XLSX;
	
	Пакет = Новый ПакетОтображаемыхДокументов;	
	
	СписокОбластей = Новый СписокЗначений;
	
	Для каждого КлючЗначение Из ТабДокДляПечати Цикл
		
		ПредставлениеОбласти = КлючЗначение.Ключ;
		
		ВхождениеПервойСкобки = СтрНайти(ПредставлениеОбласти,"(");

		Если ВхождениеПервойСкобки > 0 Тогда
			ПредставлениеОбласти = Лев(ПредставлениеОбласти, ВхождениеПервойСкобки -1);
		КонецЕсли;
		
		Попытка 
			ПредставлениеОбласти = Число(ПредставлениеОбласти);
		Исключение		
		КонецПопытки;

		СписокОбластей.Добавить(ПредставлениеОбласти, КлючЗначение.Ключ);
		
	КонецЦикла;	
	
	СписокОбластей.СортироватьПоЗначению();
	
	Для Каждого Область Из СписокОбластей Цикл
		
		ЭлементПакета = Пакет.Состав.Добавить();
		ЭлементПакета.Наименование = Область.Представление;
		ЭлементПакета.Данные = ПоместитьВоВременноеХранилище(ТабДокДляПечати.Получить(Область.Представление));
		
	КонецЦикла;
	
	Ошибка = "";
	
	Попытка		
		Пакет.Записать(vFilePath, ТипФайлаПакетаОтображаемыхДокументов.XLSX);	
	Исключение
		Ошибка = ОписаниеОшибки();
	КонецПопытки;	
	
	MessageSubject = vFileName;
	
	Пользователь = SessionParameters.CurrentUser;
	EMailList = Новый СписокЗначений;
	EMailList.Добавить(Пользователь.EMail);
	vParams = New Structure();
	vParams.Insert("SelMessageSubject", MessageSubject);
	vParams.Insert("SelEMails", "");
	vParams.Insert("SelToList", EMailList);
	
	vFile = New Structure();
	vFile.Insert("FileName", cmGetValidFileName(MessageSubject)+".XLSX");
	vFile.Insert("FullFileNameAtClient", "");
	vFile.Insert("FullFileNameAtServer", vFilePath);
	vFile.Insert("CheckRemoveAtClient",  False);
	vFile.Insert("CheckRemoveAtServer", True);
	vParams.Insert("SelFile", vFile);
	vParams.Insert("SelSenderName", "");
	
	Если Не ПустаяСтрока(Ошибка) Тогда
		vParams.Вставить("Ошибка", Ошибка);
	КонецЕсли;
	
	Return vParams;
	
EndFunction
